
age = 25 #Инициализация переменной типа int
print("Возраст: " + str(age)) #Вывод переменной age после преобразования в тип str
print("Возраст:", age) #Вывод переменной age

temp = 5.9 #Инициализация переменной типа float
print("Температура:", temp, "градусов") #Вывод переменной temp

username = "Alex" #Инициализация переменной типа str
print("Имя пользователя:", username); print("Имя пользователя:", username) #Вывод переменной username дважды

isexists = True #Инициализация переменной типа bool
print("Существует:", isexists) #Вывод переменной isexists
isexists = False #Изменение значения переменной isexists
print("Существует:", isexists) #Вывод переменной isexists

age = "18.5" #Изменение значения и типа переменной age
print("Возраст: " + age) #Вывод переменной age
'''
Выводим типы переменных
с помощью функций print и type
'''
print("Тип переменной age: ", type(age))
print("Тип переменной temp: ", type(temp))
print("Тип переменной isexists: ", type(isexists))
print("Тип переменной integer: ", type(10))

#Создание многострочного значения строковой переменной
text = '''Первая строка
Вторая строка
Третья строка'''
print(text) #Вывод переменной text

print('________________________________________________________________________________________________')
# УПРАЖНЕНИЯ

#1) Прокомментируйте каждую строчку кода из предыдущего упражнения.

x=10 # Создание переменной с присвоением ей значения int
print(x) # Вывод значения переменной в консоль Run
x=15 # Создание переменной с присвоением ей значения int
print('x =',x) # Вывод строки (имени переменной) и значения переменной в консоль Run
str1='«Значение переменной»' # Создание переменной с присвоением ей значения str
str2='«равно»' # Создание переменной с присвоением ей значения str
print(str1, str2) # Вывод значения переменных в консоль Run
bool1=True # Создание переменной с присвоением ей значения bool=True
bool2=False # Создание переменной с присвоением ей значения bool=False
''' Вывод значения переменных в консоль Run '''
print(bool1, bool2)

