
# ИСКЛЮЧЕНИЯ

try:
    a = float("abc")
except ValueError:
    print("Невозможно привести к числу!")

while True:
    a = input("Введите положительное число: ")
    try:
        a = float(a)
        if a <= 0:
            raise Exception("Число не положительное!")
    except ValueError:
        print("Невозможно привести к числу!")
    except Exception as exp:
        print(exp)
    else:
        print("Спасибо за корректный ввод!")
    finally:
        print("В любом случае, завершаем программу...")
        exit(0)

# УПРАЖНЕНИЯ смотри lesson_2.17_(exercise)

# 1) Узнайте, какое исключение появляется при делении числа на 0.
# 2) Попросите пользователя ввести 2 числа.
# 3) Выведите результат деления.
# 4) Перехватите исключение при делении на 0 и выведите пользователю в качестве результата слово «бесконечность».


