
# АРИФМЕТИЧЕСКИЕ ОПЕРАЦИИ

x = 59
y = 20
print("x =", x)
print("y =", y)

#Основные математические операции
print("x + y =", x + y)
print("x - y =", x - y)
print("x * y =", x * y)
print("x / y =", x / y)
print("x % y =", x % y)
print("x // y =", x // y)
print("x ** y =", x ** y)
print("2 ** 3 =", 2 ** 3)
print("(2 + 3 * 3) * 2 =", (2 + 3 * 3) * 2)

#Битовые операции
x = 5
y = 7
print("x =", x, "=", bin(x))
print("x =", x, "=", hex(x))
print("20 =", hex(20))
print("10 =", oct(10))
print("----------")
print("x =", x, "=", bin(x))
print("y =", y, "=", bin(y))
print("x | y =", bin(x | y))
print("x & y =", bin(x & y))
print("x ^ y =", bin(x ^ y))
print("~x =", bin(~x))
print("x << 1 =", bin(x << 1))
print("x >> 1 =", bin(x >> 1))

print('______________________________________________________________________________________________________________')

# УПРАЖНЕНИЯ

#1) Создайте 2 числовые переменные со значениями на Ваш выбор.

#2) Выведите через print() результат: суммы, разности, произведения, остатка от деления, получение целой части при
# делении, возведении в степень этих чисел.

#3) С помощью print() посчитайте, чему равно значение следующего выражения: ((15 * 10 – 20) / 2) + 14 * 10 + (-45)

#4) Создайте переменную, в которую запишите значение одного из чисел в двоичной системе счисления.

#5) Выведите эту переменную.

x=20
y=3.5
print('z=',x+y)
print('z=',x-y)
print('z=',x*y)
print('z=',x/y)
print('z=',x%y)
print('z=',x//y)
print('z=',x**y)
print('z=',((15*10-20)/2)+14*10+(-45))
a=0b100
print('a=',a)

