
#1) Прокомментируйте каждую строчку кода из предыдущего упражнения.

x=10 # Создание переменной с присвоением ей значения int
print(x) # Вывод значения переменной в консоль Run
x=15 # Создание переменной с присвоением ей значения int
print('x =',x) # Вывод строки (имени переменной) и значения переменной в консоль Run
str1='«Значение переменной»' # Создание переменной с присвоением ей значения str
str2='«равно»' # Создание переменной с присвоением ей значения str
print(str1, str2) # Вывод значения переменных в консоль Run
bool1=True # Создание переменной с присвоением ей значения bool=True
bool2=False # Создание переменной с присвоением ей значения bool=False
''' Вывод 
значения переменных 
в консоль Run '''
print(bool1, bool2)

